configuration/src/InformationRegisters/СтатистикаСтатусовНазначенныхЗадач/СтатистикаСтатусовНазначенныхЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатистикаСтатусовНазначенныхЗадач</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Время</name>
    <comment>Время в секундах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.Задача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Catalogs/СтатусыОбъектов/СтатусыОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатусыОбъектов</name>
  <comment>Хранит  элементы, соответствующие определенным статусам объектов.</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>CodeReview</name>
      <description>Code review</description>
    </items>
    <items>
      <name>DesignReview</name>
      <description>Design review</description>
    </items>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>ВРеализацию</name>
      <description>В реализацию</description>
    </items>
    <items>
      <name>Внедрение</name>
      <description>Внедрение</description>
    </items>
    <items>
      <name>ВнутреннееТестирование</name>
      <description>Внутреннее тестирование</description>
    </items>
    <items>
      <name>Документирование</name>
      <description>Документирование</description>
    </items>
    <items>
      <name>ЗапросТребований</name>
      <description>Запрос требований</description>
    </items>
    <items>
      <name>Масштабирование</name>
      <description>Масштабирование</description>
    </items>
    <items>
      <name>НаДоработку</name>
      <description>На доработку</description>
    </items>
    <items>
      <name>Рассмотрение</name>
      <description>На рассмотрении</description>
    </items>
    <items>
      <name>Новый</name>
      <description>Новый</description>
    </items>
    <items>
      <name>Отклонен</name>
      <description>Отклонен</description>
    </items>
    <items>
      <name>Отложен</name>
      <description>Отложен</description>
    </items>
    <items>
      <name>Приостановлен</name>
      <description>Приостановлен</description>
    </items>
    <items>
      <name>Проработка</name>
      <description>Проработка</description>
    </items>
    <items>
      <name>Протестирован</name>
      <description>Протестирован</description>
    </items>
    <items>
      <name>Публикация</name>
      <description>Публикация</description>
    </items>
    <items>
      <name>Рассмотрен</name>
      <description>Рассмотрен</description>
    </items>
    <items>
      <name>РевьюТребований</name>
      <description>Ревью требований</description>
    </items>
    <items>
      <name>Решен</name>
      <description>Решен</description>
    </items>
    <items>
      <name>Тестирование</name>
      <description>Тестирование</description>
    </items>
  </predefined>
  <attributes>
    <name>ИмяКартинкиВБиблиотеке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЗафиксирован</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс изображения в общей картинке СтатусыОбъектов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <comment>Порядковый номер статуса</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПричиныИзмененияСтатуса</name>
    <attributes>
      <name>Причина</name>
      <type>
        <types>CatalogRef.ПричиныИзмененияСтатусов</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/InformationRegisters/СтатистикаСтатусовНазначенныхЗадач/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ВнешнееСоединение ИЛИ ТолстыйКлиентОбычноеПриложение Тогда

#Область ПрограммныйИнтерфейс

// Закрывает последнюю незакрытую запись и созадет новую
//
// Параметры:
//  Задача		 - ДокументСсылка.Задача			 - задача которую необходимо обработать
//  Статус		 - СправочникСсылка.СтатусыОбъектов	 - новый статус задачи
//  Пользователь - СправочникСсылка.Пользователи	 - пользователь, на которого назначена задача
//  ДатаЗаписи	 - Дата (дата и время)				 - дата, которой будут добавлены записи
//
Процедура ОбработатьИзменениеСтатусаЗадачи(Знач Задача, Знач Статус, Знач Пользователь, Знач ДатаЗаписи = Неопределено) Экспорт
	
	ИмяСобытия = ИмяСобытияЖурналаРегистрации();
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Если ДатаЗаписи <> Неопределено Тогда
		ТекущаяДата = ДатаЗаписи;
	КонецЕсли;
	
	// Получим последнюю запись из регистра в разрезе задачи
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	МАКСИМУМ(СтатистикаСтатусовНазначенныхЗадачСрезПоследних.Период) КАК Период,
	|	СтатистикаСтатусовНазначенныхЗадачСрезПоследних.Задача КАК Задача,
	|	СтатистикаСтатусовНазначенныхЗадачСрезПоследних.Статус КАК Статус,
	|	СтатистикаСтатусовНазначенныхЗадачСрезПоследних.Пользователь КАК Пользователь,
	|	СтатистикаСтатусовНазначенныхЗадачСрезПоследних.ДатаОкончания КАК ДатаОкончания,
	|	СтатистикаСтатусовНазначенныхЗадачСрезПоследних.Время КАК Время
	|ИЗ
	|	РегистрСведений.СтатистикаСтатусовНазначенныхЗадач.СрезПоследних(&ТекущаяДата, Задача = &Задача) КАК СтатистикаСтатусовНазначенныхЗадачСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	СтатистикаСтатусовНазначенныхЗадачСрезПоследних.Задача,
	|	СтатистикаСтатусовНазначенныхЗадачСрезПоследних.Статус,
	|	СтатистикаСтатусовНазначенныхЗадачСрезПоследних.Пользователь,
	|	СтатистикаСтатусовНазначенныхЗадачСрезПоследних.ДатаОкончания,
	|	СтатистикаСтатусовНазначенныхЗадачСрезПоследних.Время
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		// Если была получена запись, то нужно её закрыть.
		// Время будет рассчитано регламентным заданием.
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Если НЕ ЗначениеЗаполнено(Выборка.ДатаОкончания) Тогда
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
			НаборЗаписей.Отбор.Задача.Установить(Выборка.Задача);
			НаборЗаписей.Отбор.Статус.Установить(Выборка.Статус);
			НаборЗаписей.Отбор.Пользователь.Установить(Выборка.Пользователь);
			
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
			НоваяЗапись.Время = 0;
			НоваяЗапись.ДатаОкончания = ТекущаяДата;
			
			Попытка
				НаборЗаписей.Записать();
			Исключение
				Информация = ИнформацияОбОшибке();
				ПодробнаяИнформация = ПодробноеПредставлениеОшибки(Информация);
				
				ТекстОшибки = СтрШаблон("Не удалось закрыть период задачи по причине: %1", ПодробнаяИнформация);
				
				ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, 
					РегистрыСведений.СтатистикаСтатусовНазначенныхЗадач, , ТекстОшибки);
				Возврат;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	// В случае, если пользователь заполнен и задача не переведена в статус
	// Решен или Отклонен, то нужно добавить новую запись.
	Если ЗначениеЗаполнено(Пользователь)
		И Статус <> Справочники.СтатусыОбъектов.Решен
		И Статус <> Справочники.СтатусыОбъектов.Отклонен Тогда
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(ТекущаяДата);
		НаборЗаписей.Отбор.Задача.Установить(Задача);
		НаборЗаписей.Отбор.Статус.Установить(Статус);
		НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = ТекущаяДата;
		НоваяЗапись.Задача = Задача;
		НоваяЗапись.Статус = Статус;
		НоваяЗапись.Пользователь = Пользователь;
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
			Информация = ИнформацияОбОшибке();
			ПодробнаяИнформация = ПодробноеПредставлениеОшибки(Информация);
			
			ТекстОшибки = СтрШаблон("Не удалось открыть период задачи по причине: %1", ПодробнаяИнформация);
			
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, 
				РегистрыСведений.СтатистикаСтатусовНазначенныхЗадач, , ТекстОшибки);
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры
		
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяСобытияЖурналаРегистрации()
	
	Возврат "РегистрСведений.СтатистикаСтатусовНазначенныхЗадач.ОбработатьИзменениеСтатусаЗадачи";
	
КонецФункции

#КонецОбласти

#КонецЕсли
